app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("bname", "bwriter", "bprise", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["bname", "DJ "], ["bwriter", "Venky"], ["bprise", 2000000], ["created_at", "2019-06-14 06:22:30.122216"], ["updated_at", "2019-06-14 06:22:30.122216"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])